## Test on Python - 04/16

In [1]:
import os
import pandas as pd
import numpy as np

### 1. Write a program (with function) which takes a sequence of numbers and check if all numbers are unique.

In [46]:
def check_seq(list1):
    '''Function is to check the sequence of numbers are unique or not'''
    j = 0
    k = 0
    list1.sort()
    print(list1)
    for i in list1:
        print('i:', i)
        print('j:', j)
        if j == 0:
            pass
        else:
            if i == j:
                print('Sequence of numbers are not unique')
                k = 1
                break
        j = i
        
    if k != 1:
        print('Sequence of numbers are unique')

list1 = [2,3,8,6,3,5]
list2 = [3,8,7,9,2,4]

print(check_seq.__doc__)
print("\n")
print("Result for list1 : \n")

check_seq(list1)
print("\n")
print("Result for list2 : \n")
check_seq(list2)

Function is to check the sequence of numbers are unique or not


Result for list1 :

[2, 3, 3, 5, 6, 8]
i: 2
j: 0
i: 3
j: 2
i: 3
j: 3
Sequence of numbers are not unique


Result for list2 :

[2, 3, 4, 7, 8, 9]
i: 2
j: 0
i: 3
j: 2
i: 4
j: 3
i: 7
j: 4
i: 8
j: 7
i: 9
j: 8
Sequence of numbers are unique

### 2. Python program to find out the average of a set of integers
#### a. Note: Don’t use the pre-defined functions like np.mean
#### b. For ex: If input is 5, the output should be average of 1+2+3+4+5

In [54]:
def avg_fun(x):
    '''Function is to calculate the average of the set of integers'''
    if x == 1:
        return x
    else:
        return (x + avg_fun(x-1))
num = int(input('enter the value : '))
n = avg_fun(num)
print(avg_fun.__doc__)
print("Average of : ", num, 'is', n/num)

enter the value : 5
Function is to calculate the average of the set of integers
Average of :  5 is 3.0

### 3. Python program to check whether the given integer is a multiple of both 5 and 7

In [62]:
def check_int(num):
    '''Function is to check the entered value is multiple of 5 and 7 '''
    if (num%5 == 0) and (num%7 == 0):
        print(" the given number is multiple of both 5 and 7")
    else:
        print("The given number is not multiple of 5 and 7")

num = int(input("Enter the value : "))
print(check_int.__doc__)
check_int(num)

Enter the value : 70
Function is to check the entered value is multiple of 5 and 7
 the given number is multiple of both 5 and 7

### 4. Python program to display the given integer in reverse manner
#### a. Ex: input 852, output should be 258

In [65]:
def rev_num(num):
    j = ''
    num_str = str(num)
    for i in num_str:
        j = i + j
    print(j)
rev_num(852)

258

In [68]:
def gen_rev(arg1):
    a = ''
    arg1 = str(arg1)
    len1 = len(arg1)
    for i in range(len1-1,-1,-1):
        a = a + arg1[i]
    print(a)
rev = gen_rev(852)

258

### 5. Create an inner function to calculate the addition in the following way
#### a. Create an outer function that will accept two parameters, a and b
#### b. Create an inner function inside an outer function that will calculate the addition of a and b
#### c. At last, an outer function will add 5 into addition and return it

In [72]:
def out_fun(a,b):
    def inn_fun():
        c = 0;
        c = a + b
        return c
    return inn_fun()
out_fun(5,6)

11

### 6. Python Program to Check Leap Year
#### a. A leap year is exactly divisible by 4 except for century years (years ending with 00). The century year is a leap year only if it is perfectly divisible by 400
#### b. For ex: 2017 is not a leap year, 1900 is a not leap year, 2012 is a leap year, 2000 is a leap year

In [84]:
def check_leap_yr(year):
    year = int(year)
    print(year)
    if year%4 == 0:
        if year%100 == 0:
            if year%400 == 0:
                print("It is a leap year")
            else:
                print("It is not a leap year")
        else:
            print("It is a leap year")
    else:
        print("It is not a leap year")
check_leap_yr(1600)

1600
It is a leap year

### Part 2 – Pandas exercise (basic)

In [85]:
os.chdir(r"C:\Users\kalya\Santhosh\Data Science\Notebook\Preprocessing")

In [86]:
df = pd.read_csv('Auto.csv')

In [87]:
df.head()

,symboling,normalized_losses,make,fuel_type,aspiration,num_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
0,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111.0,5000.0,21,27,13495.0
1,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111.0,5000.0,21,27,16500.0
2,1,NaN,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154.0,5000.0,19,26,16500.0
3,2,164.0,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.40,10.0,102.0,5500.0,24,30,13950.0
4,2,164.0,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.40,8.0,115.0,5500.0,18,22,17450.0

In [88]:
df.dtypes

symboling              int64
normalized_losses    float64
make                  object
fuel_type             object
aspiration            object
num_doors             object
body_style            object
drive_wheels          object
engine_location       object
wheel_base           float64
length               float64
width                float64
height               float64
curb_weight            int64
engine_type           object
num_cylinders         object
engine_size            int64
fuel_system           object
bore                 float64
stroke               float64
compression_ratio    float64
horsepower           float64
peak_rpm             float64
city_mpg               int64
highway_mpg            int64
price                float64
dtype: object

In [90]:
df.columns

Index(['symboling', 'normalized_losses', 'make', 'fuel_type', 'aspiration',
       'num_doors', 'body_style', 'drive_wheels', 'engine_location',
       'wheel_base', 'length', 'width', 'height', 'curb_weight', 'engine_type',
       'num_cylinders', 'engine_size', 'fuel_system', 'bore', 'stroke',
       'compression_ratio', 'horsepower', 'peak_rpm', 'city_mpg',
       'highway_mpg', 'price'],
      dtype='object')

### 1. Find the most expensive car company name

In [99]:
df[df['price'] == df['price'].max()][['make', 'price']]

             make    price
74  mercedes-benz  45400.0

### 2. Count total cars per company

In [109]:
df['make'].value_counts().sort_values()

mercury           1
renault           2
alfa-romero       3
chevrolet         3
jaguar            3
isuzu             4
porsche           5
saab              6
plymouth          7
audi              7
bmw               8
mercedes-benz     8
dodge             9
volvo            11
peugot           11
subaru           12
volkswagen       12
honda            13
mitsubishi       13
mazda            17
nissan           18
toyota           32
Name: make, dtype: int64

### 3. Find each company’s highest price car

In [115]:
df.groupby(['make'])['price'].max()

make
alfa-romero      16500.0
audi             23875.0
bmw              41315.0
chevrolet         6575.0
dodge            12964.0
honda            12945.0
isuzu            11048.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mercury          16503.0
mitsubishi       14869.0
nissan           19699.0
peugot           18150.0
plymouth         12764.0
porsche          37028.0
renault           9895.0
saab             18620.0
subaru           11694.0
toyota           17669.0
volkswagen       13845.0
volvo            22625.0
Name: price, dtype: float64

### 4. Sort all cars by Price column

In [132]:
df1 = df.sort_values(by = 'price', ascending = False, ignore_index = True)
df1[['make','price']]

              make    price
0    mercedes-benz  45400.0
1              bmw  41315.0
2    mercedes-benz  40960.0
3          porsche  37028.0
4              bmw  36880.0
..             ...      ...
200         subaru   5118.0
201           audi      NaN
202          isuzu      NaN
203          isuzu      NaN
204        porsche      NaN

[205 rows x 2 columns]

### 5. Group by make, fuel-type and body-style to calculate the average of city-mpg and highwaympg (miles per gallon)

In [134]:
df.groupby(['make','fuel_type','body_style'])['city_mpg','highway_mpg'].mean()

C:\Users\kalya\AppData\Local\Temp/ipykernel_16108/2762477423.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby(['make','fuel_type','body_style'])['city_mpg','highway_mpg'].mean()

                                    city_mpg  highway_mpg
make        fuel_type body_style
alfa-romero gas       convertible  21.000000    27.000000
                      hatchback    19.000000    26.000000
audi        gas       hatchback    16.000000    22.000000
                      sedan        19.400000    24.400000
                      wagon        19.000000    25.000000
...                                      ...          ...
volkswagen  gas       sedan        25.200000    31.600000
                      wagon        25.000000    31.000000
volvo       diesel    sedan        26.000000    27.000000
            gas       sedan        20.428571    25.571429
                      wagon        21.333333    26.000000

[66 rows x 2 columns]

### Part 3 - MCQ:

In [ ]:
1st one answer is : 3
    result = list(map(lambda r: r*3, filter(lambda f: f>3 or 0,data)))

In [ ]:
2nd one answer is : IS NOT

In [ ]:
3rd one answer is : three
    try:
        foo()
    catch:
        except BaseException as variable:
            print(variable)

In [ ]:
4th one answer is : print("{:.2f}".format(3.142))

5th one answer is : A generator will generate all the even integers from vector

In [ ]:
6th one answer is : 4 (z contins 4 value)

In [ ]:
7th one answer is : return (x,y)

In [ ]:
8th one answer is as below :
    before = [1,2,3,4,5,7]
    after = [1,2,3,4,5,7]

In [ ]:
9th one answere is : assertion failed

In [ ]:
10th one answer is : 300

In [ ]:
11th one answer is : slst = sort(lst)

In [ ]:
12th one answer is : METHODS